var locations = {
	"七台河市": {
		"prov": "黑龙江",
		"lnt": 131.019,
		"lat": 45.775
	},
	"万宁市": {
		"prov": "海南",
		"lnt": 110.293,
		"lat": 18.8399
	},
	"三亚市": {
		"prov": "海南",
		"lnt": 109.523,
		"lat": 18.2578
	},
	"三明市": {
		"prov": "福建",
		"lnt": 117.642,
		"lat": 26.2708
	},
	"三门峡市": {
		"prov": "河南",
		"lnt": 111.181,
		"lat": 34.7833
	},
	"上海市": {
		"prov": "上海",
		"lnt": 121.488,
		"lat": 31.2492
	},
	"上饶市": {
		"prov": "江西",
		"lnt": 117.955,
		"lat": 28.4576
	},
	"东方市": {
		"prov": "海南",
		"lnt": 108.851,
		"lat": 18.9982
	},
	"东莞市": {
		"prov": "广东",
		"lnt": 113.763,
		"lat": 23.043
	},
	"东营市": {
		"prov": "山东",
		"lnt": 118.584,
		"lat": 37.4871
	},
	"中卫市": {
		"prov": "宁夏",
		"lnt": 105.197,
		"lat": 37.5211
	},
	"中山市": {
		"prov": "广东",
		"lnt": 113.422,
		"lat": 22.5452
	},
	"临夏州市": {
		"prov": "甘肃",
		"lnt": 103.215,
		"lat": 35.5985
	},
	"临汾市": {
		"prov": "山西",
		"lnt": 111.539,
		"lat": 36.0997
	},
	"临沂市": {
		"prov": "山东",
		"lnt": 118.341,
		"lat": 35.0724
	},
	"临沧市": {
		"prov": "云南",
		"lnt": 100.093,
		"lat": 23.8878
	},
	"临高市": {
		"prov": "海南",
		"lnt": 109.724,
		"lat": 19.8059
	},
	"丹东市": {
		"prov": "辽宁",
		"lnt": 124.339,
		"lat": 40.129
	},
	"丽水市": {
		"prov": "浙江",
		"lnt": 119.93,
		"lat": 28.4563
	},
	"丽江市": {
		"prov": "云南",
		"lnt": 100.23,
		"lat": 26.8754
	},
	"乌兰察布市": {
		"prov": "内蒙古",
		"lnt": 113.113,
		"lat": 41.0224
	},
	"乌海市": {
		"prov": "内蒙古",
		"lnt": 106.832,
		"lat": 39.6832
	},
	"乌鲁木齐市": {
		"prov": "新疆",
		"lnt": 87.565,
		"lat": 43.8404
	},
	"乐东市": {
		"prov": "海南",
		"lnt": 109.063,
		"lat": 18.6586
	},
	"乐山市": {
		"prov": "四川",
		"lnt": 103.761,
		"lat": 29.601
	},
	"九江市": {
		"prov": "江西",
		"lnt": 116,
		"lat": 29.7196
	},
	"云浮市": {
		"prov": "广东",
		"lnt": 112.051,
		"lat": 22.938
	},
	"五家渠市": {
		"prov": "新疆",
		"lnt": 87.5655,
		"lat": 44.3689
	},
	"五指山市": {
		"prov": "海南",
		"lnt": 109.518,
		"lat": 18.8313
	},
	"亳州市": {
		"prov": "安徽",
		"lnt": 115.788,
		"lat": 33.8712
	},
	"仙桃市": {
		"prov": "湖北",
		"lnt": 113.387,
		"lat": 30.294
	},
	"伊春市": {
		"prov": "黑龙江",
		"lnt": 128.911,
		"lat": 47.7347
	},
	"伊犁州市": {
		"prov": "新疆",
		"lnt": 81.2979,
		"lat": 43.9222
	},
	"佛山市": {
		"prov": "广东",
		"lnt": 113.134,
		"lat": 23.0351
	},
	"佳木斯市": {
		"prov": "黑龙江",
		"lnt": 130.285,
		"lat": 46.8138
	},
	"保亭市": {
		"prov": "海南",
		"lnt": 109.656,
		"lat": 18.5976
	},
	"保定市": {
		"prov": "河北",
		"lnt": 115.495,
		"lat": 38.8866
	},
	"保山市": {
		"prov": "云南",
		"lnt": 99.178,
		"lat": 25.1205
	},
	"信阳市": {
		"prov": "河南",
		"lnt": 114.085,
		"lat": 32.1286
	},
	"儋州市": {
		"prov": "海南",
		"lnt": 109.414,
		"lat": 19.5712
	},
	"克孜勒苏州市": {
		"prov": "新疆",
		"lnt": 76.1376,
		"lat": 39.7503
	},
	"克拉玛依市": {
		"prov": "新疆",
		"lnt": 84.8812,
		"lat": 45.5943
	},
	"六安市": {
		"prov": "安徽",
		"lnt": 116.505,
		"lat": 31.7556
	},
	"六盘水市": {
		"prov": "贵州",
		"lnt": 104.852,
		"lat": 26.5919
	},
	"兰州市": {
		"prov": "甘肃",
		"lnt": 103.823,
		"lat": 36.0642
	},
	"兴安盟市": {
		"prov": "内蒙古",
		"lnt": 122.048,
		"lat": 46.0838
	},
	"内江市": {
		"prov": "四川",
		"lnt": 105.073,
		"lat": 29.5995
	},
	"凉山州市": {
		"prov": "四川",
		"lnt": 102.26,
		"lat": 27.8924
	},
	"包头市": {
		"prov": "内蒙古",
		"lnt": 109.846,
		"lat": 40.6471
	},
	"北京市": {
		"prov": "北京",
		"lnt": 116.396,
		"lat": 39.93
	},
	"北海市": {
		"prov": "广西",
		"lnt": 109.123,
		"lat": 21.4727
	},
	"十堰市": {
		"prov": "湖北",
		"lnt": 110.801,
		"lat": 32.637
	},
	"南京市": {
		"prov": "江苏",
		"lnt": 118.778,
		"lat": 32.0572
	},
	"南充市": {
		"prov": "四川",
		"lnt": 106.106,
		"lat": 30.801
	},
	"南宁市": {
		"prov": "广西",
		"lnt": 108.297,
		"lat": 22.8065
	},
	"南平市": {
		"prov": "福建",
		"lnt": 118.182,
		"lat": 26.6436
	},
	"南昌市": {
		"prov": "江西",
		"lnt": 115.894,
		"lat": 28.6896
	},
	"南通市": {
		"prov": "江苏",
		"lnt": 120.874,
		"lat": 32.0147
	},
	"南阳市": {
		"prov": "河南",
		"lnt": 112.543,
		"lat": 33.0114
	},
	"博尔塔拉州市": {
		"prov": "新疆",
		"lnt": 82.0524,
		"lat": 44.9137
	},
	"厦门市": {
		"prov": "福建",
		"lnt": 118.104,
		"lat": 24.4892
	},
	"双鸭山市": {
		"prov": "黑龙江",
		"lnt": 131.171,
		"lat": 46.6551
	},
	"台州市": {
		"prov": "浙江",
		"lnt": 121.441,
		"lat": 28.6683
	},
	"台湾市": {
		"prov": "台湾",
		"lnt": 120.961,
		"lat": 23.8041
	},
	"合肥市": {
		"prov": "安徽",
		"lnt": 117.283,
		"lat": 31.8669
	},
	"吉安市": {
		"prov": "江西",
		"lnt": 114.992,
		"lat": 27.1138
	},
	"吉林市": {
		"prov": "吉林",
		"lnt": 126.565,
		"lat": 43.872
	},
	"吐鲁番地区市": {
		"prov": "新疆",
		"lnt": 89.1816,
		"lat": 42.9605
	},
	"吕梁市": {
		"prov": "山西",
		"lnt": 111.143,
		"lat": 37.5273
	},
	"吴忠市": {
		"prov": "宁夏",
		"lnt": 106.208,
		"lat": 37.9936
	},
	"周口市": {
		"prov": "河南",
		"lnt": 114.654,
		"lat": 33.6237
	},
	"呼伦贝尔市": {
		"prov": "内蒙古",
		"lnt": 119.761,
		"lat": 49.2016
	},
	"呼和浩特市": {
		"prov": "内蒙古",
		"lnt": 111.66,
		"lat": 40.8283
	},
	"和田地区市": {
		"prov": "新疆",
		"lnt": 79.9302,
		"lat": 37.1168
	},
	"咸宁市": {
		"prov": "湖北",
		"lnt": 114.3,
		"lat": 29.8807
	},
	"咸阳市": {
		"prov": "陕西",
		"lnt": 108.708,
		"lat": 34.3454
	},
	"哈密地区市": {
		"prov": "新疆",
		"lnt": 93.5284,
		"lat": 42.8586
	},
	"哈尔滨市": {
		"prov": "黑龙江",
		"lnt": 126.658,
		"lat": 45.7732
	},
	"唐山市": {
		"prov": "河北",
		"lnt": 118.183,
		"lat": 39.6505
	},
	"商丘市": {
		"prov": "河南",
		"lnt": 115.642,
		"lat": 34.4386
	},
	"商洛市": {
		"prov": "陕西",
		"lnt": 109.934,
		"lat": 33.8739
	},
	"喀什地区市": {
		"prov": "新疆",
		"lnt": 75.993,
		"lat": 39.4706
	},
	"嘉兴市": {
		"prov": "浙江",
		"lnt": 120.76,
		"lat": 30.774
	},
	"嘉峪关市": {
		"prov": "甘肃",
		"lnt": 98.2816,
		"lat": 39.8024
	},
	"四平市": {
		"prov": "吉林",
		"lnt": 124.391,
		"lat": 43.1755
	},
	"固原市": {
		"prov": "宁夏",
		"lnt": 106.285,
		"lat": 36.0215
	},
	"图木舒克市": {
		"prov": "新疆",
		"lnt": 79.1982,
		"lat": 39.8892
	},
	"塔城地区市": {
		"prov": "新疆",
		"lnt": 82.9749,
		"lat": 46.7587
	},
	"大兴安岭地区市": {
		"prov": "黑龙江",
		"lnt": 124.196,
		"lat": 51.9918
	},
	"大同市": {
		"prov": "山西",
		"lnt": 113.291,
		"lat": 40.1137
	},
	"大庆市": {
		"prov": "黑龙江",
		"lnt": 125.022,
		"lat": 46.5967
	},
	"大理州市": {
		"prov": "云南",
		"lnt": 100.224,
		"lat": 25.5969
	},
	"大连市": {
		"prov": "辽宁",
		"lnt": 121.593,
		"lat": 38.9487
	},
	"天水市": {
		"prov": "甘肃",
		"lnt": 105.737,
		"lat": 34.5843
	},
	"天津市": {
		"prov": "天津",
		"lnt": 117.211,
		"lat": 39.1439
	},
	"天门市": {
		"prov": "湖北",
		"lnt": 113.126,
		"lat": 30.649
	},
	"太原市": {
		"prov": "山西",
		"lnt": 112.551,
		"lat": 37.8903
	},
	"威海市": {
		"prov": "山东",
		"lnt": 122.094,
		"lat": 37.5288
	},
	"娄底市": {
		"prov": "湖南",
		"lnt": 111.996,
		"lat": 27.7411
	},
	"孝感市": {
		"prov": "湖北",
		"lnt": 113.936,
		"lat": 30.928
	},
	"宁德市": {
		"prov": "福建",
		"lnt": 119.542,
		"lat": 26.6565
	},
	"宁波市": {
		"prov": "浙江",
		"lnt": 121.579,
		"lat": 29.8853
	},
	"安庆市": {
		"prov": "安徽",
		"lnt": 117.059,
		"lat": 30.5379
	},
	"安康市": {
		"prov": "陕西",
		"lnt": 109.038,
		"lat": 32.7044
	},
	"安阳市": {
		"prov": "河南",
		"lnt": 114.352,
		"lat": 36.1103
	},
	"安顺市": {
		"prov": "贵州",
		"lnt": 105.928,
		"lat": 26.2286
	},
	"定安市": {
		"prov": "海南",
		"lnt": 110.32,
		"lat": 19.491
	},
	"定西市": {
		"prov": "甘肃",
		"lnt": 104.627,
		"lat": 35.5861
	},
	"宜宾市": {
		"prov": "四川",
		"lnt": 104.633,
		"lat": 28.7697
	},
	"宜昌市": {
		"prov": "湖北",
		"lnt": 111.311,
		"lat": 30.7328
	},
	"宜春市": {
		"prov": "江西",
		"lnt": 114.4,
		"lat": 27.8111
	},
	"宝鸡市": {
		"prov": "陕西",
		"lnt": 107.171,
		"lat": 34.3641
	},
	"宣城市": {
		"prov": "安徽",
		"lnt": 118.752,
		"lat": 30.9516
	},
	"宿州市": {
		"prov": "安徽",
		"lnt": 116.989,
		"lat": 33.6368
	},
	"宿迁市": {
		"prov": "江苏",
		"lnt": 118.297,
		"lat": 33.952
	},
	"屯昌市": {
		"prov": "海南",
		"lnt": 110.063,
		"lat": 19.3477
	},
	"山南地区市": {
		"prov": "西藏",
		"lnt": 91.7506,
		"lat": 29.229
	},
	"岳阳市": {
		"prov": "湖南",
		"lnt": 113.146,
		"lat": 29.378
	},
	"崇左市": {
		"prov": "广西",
		"lnt": 107.357,
		"lat": 22.4155
	},
	"巢湖市": {
		"prov": "安徽",
		"lnt": 117.88,
		"lat": 31.6087
	},
	"巴中市": {
		"prov": "四川",
		"lnt": 106.758,
		"lat": 31.8692
	},
	"巴彦淖尔市": {
		"prov": "内蒙古",
		"lnt": 107.424,
		"lat": 40.7692
	},
	"巴音郭楞市": {
		"prov": "新疆",
		"lnt": 86.1217,
		"lat": 41.7714
	},
	"常州市": {
		"prov": "江苏",
		"lnt": 119.982,
		"lat": 31.7714
	},
	"常德市": {
		"prov": "湖南",
		"lnt": 111.654,
		"lat": 29.0121
	},
	"平凉市": {
		"prov": "甘肃",
		"lnt": 106.689,
		"lat": 35.5501
	},
	"平顶山市": {
		"prov": "河南",
		"lnt": 113.301,
		"lat": 33.7453
	},
	"广元市": {
		"prov": "四川",
		"lnt": 105.82,
		"lat": 32.441
	},
	"广安市": {
		"prov": "四川",
		"lnt": 106.636,
		"lat": 30.464
	},
	"广州市": {
		"prov": "广东",
		"lnt": 113.308,
		"lat": 23.12
	},
	"庆阳市": {
		"prov": "甘肃",
		"lnt": 107.644,
		"lat": 35.7268
	},
	"廊坊市": {
		"prov": "河北",
		"lnt": 116.704,
		"lat": 39.5186
	},
	"延安市": {
		"prov": "陕西",
		"lnt": 109.501,
		"lat": 36.6033
	},
	"延边市": {
		"prov": "吉林",
		"lnt": 129.486,
		"lat": 42.8964
	},
	"开封市": {
		"prov": "河南",
		"lnt": 114.352,
		"lat": 34.8019
	},
	"张家口市": {
		"prov": "河北",
		"lnt": 114.894,
		"lat": 40.8112
	},
	"张家界市": {
		"prov": "湖南",
		"lnt": 110.482,
		"lat": 29.1249
	},
	"张掖市": {
		"prov": "甘肃",
		"lnt": 100.46,
		"lat": 38.9393
	},
	"徐州市": {
		"prov": "江苏",
		"lnt": 117.188,
		"lat": 34.2716
	},
	"德宏州市": {
		"prov": "云南",
		"lnt": 98.5894,
		"lat": 24.4412
	},
	"德州市": {
		"prov": "山东",
		"lnt": 116.328,
		"lat": 37.4608
	},
	"德阳市": {
		"prov": "四川",
		"lnt": 104.402,
		"lat": 31.1311
	},
	"忻州市": {
		"prov": "山西",
		"lnt": 112.728,
		"lat": 38.461
	},
	"怀化市": {
		"prov": "湖南",
		"lnt": 109.987,
		"lat": 27.5575
	},
	"怒江州市": {
		"prov": "云南",
		"lnt": 98.8599,
		"lat": 25.8607
	},
	"恩施市": {
		"prov": "湖北",
		"lnt": 109.517,
		"lat": 30.309
	},
	"惠州市": {
		"prov": "广东",
		"lnt": 114.411,
		"lat": 23.1135
	},
	"成都市": {
		"prov": "四川",
		"lnt": 104.068,
		"lat": 30.6799
	},
	"扬州市": {
		"prov": "江苏",
		"lnt": 119.428,
		"lat": 32.4085
	},
	"承德市": {
		"prov": "河北",
		"lnt": 117.934,
		"lat": 40.9925
	},
	"抚州市": {
		"prov": "江西",
		"lnt": 116.361,
		"lat": 27.9545
	},
	"抚顺市": {
		"prov": "辽宁",
		"lnt": 123.93,
		"lat": 41.8773
	},
	"拉萨市": {
		"prov": "西藏",
		"lnt": 91.1119,
		"lat": 29.6626
	},
	"揭阳市": {
		"prov": "广东",
		"lnt": 116.38,
		"lat": 23.548
	},
	"攀枝花市": {
		"prov": "四川",
		"lnt": 101.722,
		"lat": 26.5876
	},
	"文山市": {
		"prov": "云南",
		"lnt": 104.089,
		"lat": 23.4018
	},
	"文昌市": {
		"prov": "海南",
		"lnt": 110.781,
		"lat": 19.7509
	},
	"新乡市": {
		"prov": "河南",
		"lnt": 113.913,
		"lat": 35.3073
	},
	"新余市": {
		"prov": "江西",
		"lnt": 114.947,
		"lat": 27.8223
	},
	"无锡市": {
		"prov": "江苏",
		"lnt": 120.305,
		"lat": 31.57
	},
	"日喀则地区市": {
		"prov": "西藏",
		"lnt": 88.8915,
		"lat": 29.269
	},
	"日照市": {
		"prov": "山东",
		"lnt": 119.507,
		"lat": 35.4202
	},
	"昆明市": {
		"prov": "云南",
		"lnt": 102.715,
		"lat": 25.0492
	},
	"昌吉州市": {
		"prov": "新疆",
		"lnt": 87.296,
		"lat": 44.0071
	},
	"昌江市": {
		"prov": "海南",
		"lnt": 109.011,
		"lat": 19.2225
	},
	"昌都地区市": {
		"prov": "西藏",
		"lnt": 97.1856,
		"lat": 31.1406
	},
	"昭通市": {
		"prov": "云南",
		"lnt": 103.725,
		"lat": 27.3406
	},
	"晋中市": {
		"prov": "山西",
		"lnt": 112.739,
		"lat": 37.6934
	},
	"晋城市": {
		"prov": "山西",
		"lnt": 112.867,
		"lat": 35.4998
	},
	"普洱市": {
		"prov": "云南",
		"lnt": 100.98,
		"lat": 22.7888
	},
	"景德镇市": {
		"prov": "江西",
		"lnt": 117.187,
		"lat": 29.3036
	},
	"曲靖市": {
		"prov": "云南",
		"lnt": 103.783,
		"lat": 25.5208
	},
	"朔州市": {
		"prov": "山西",
		"lnt": 112.48,
		"lat": 39.3377
	},
	"朝阳市": {
		"prov": "辽宁",
		"lnt": 120.446,
		"lat": 41.5718
	},
	"本溪市": {
		"prov": "辽宁",
		"lnt": 123.778,
		"lat": 41.3258
	},
	"来宾市": {
		"prov": "广西",
		"lnt": 109.232,
		"lat": 23.7412
	},
	"杭州市": {
		"prov": "浙江",
		"lnt": 120.219,
		"lat": 30.2592
	},
	"松原市": {
		"prov": "吉林",
		"lnt": 124.833,
		"lat": 45.136
	},
	"林芝地区市": {
		"prov": "西藏",
		"lnt": 94.35,
		"lat": 29.6669
	},
	"果洛州市": {
		"prov": "青海",
		"lnt": 100.224,
		"lat": 34.4805
	},
	"枣庄市": {
		"prov": "山东",
		"lnt": 117.279,
		"lat": 34.8079
	},
	"柳州市": {
		"prov": "广西",
		"lnt": 109.422,
		"lat": 24.3291
	},
	"株洲市": {
		"prov": "湖南",
		"lnt": 113.132,
		"lat": 27.8274
	},
	"桂林市": {
		"prov": "广西",
		"lnt": 110.261,
		"lat": 25.2629
	},
	"梅州市": {
		"prov": "广东",
		"lnt": 116.126,
		"lat": 24.3046
	},
	"梧州市": {
		"prov": "广西",
		"lnt": 111.305,
		"lat": 23.4854
	},
	"楚雄州市": {
		"prov": "云南",
		"lnt": 101.529,
		"lat": 25.0664
	},
	"榆林市": {
		"prov": "陕西",
		"lnt": 109.746,
		"lat": 38.2794
	},
	"武威市": {
		"prov": "甘肃",
		"lnt": 102.64,
		"lat": 37.9332
	},
	"武汉市": {
		"prov": "湖北",
		"lnt": 114.316,
		"lat": 30.5811
	},
	"毕节地区市": {
		"prov": "贵州",
		"lnt": 105.3,
		"lat": 27.3026
	},
	"永州市": {
		"prov": "湖南",
		"lnt": 111.615,
		"lat": 26.436
	},
	"汉中市": {
		"prov": "陕西",
		"lnt": 107.045,
		"lat": 33.0816
	},
	"汕头市": {
		"prov": "广东",
		"lnt": 116.729,
		"lat": 23.3839
	},
	"汕尾市": {
		"prov": "广东",
		"lnt": 115.373,
		"lat": 22.7787
	},
	"江门市": {
		"prov": "广东",
		"lnt": 113.078,
		"lat": 22.5751
	},
	"池州市": {
		"prov": "安徽",
		"lnt": 117.494,
		"lat": 30.66
	},
	"沈阳市": {
		"prov": "辽宁",
		"lnt": 123.433,
		"lat": 41.8086
	},
	"沧州市": {
		"prov": "河北",
		"lnt": 116.864,
		"lat": 38.2976
	},
	"河池市": {
		"prov": "广西",
		"lnt": 108.07,
		"lat": 24.6995
	},
	"河源市": {
		"prov": "广东",
		"lnt": 114.714,
		"lat": 23.7573
	},
	"泉州市": {
		"prov": "福建",
		"lnt": 118.6,
		"lat": 24.9017
	},
	"泰安市": {
		"prov": "山东",
		"lnt": 117.089,
		"lat": 36.1881
	},
	"泰州市": {
		"prov": "江苏",
		"lnt": 119.92,
		"lat": 32.4761
	},
	"泸州市": {
		"prov": "四川",
		"lnt": 105.444,
		"lat": 28.8959
	},
	"洛阳市": {
		"prov": "河南",
		"lnt": 112.448,
		"lat": 34.6574
	},
	"济南市": {
		"prov": "山东",
		"lnt": 117.025,
		"lat": 36.6828
	},
	"济宁市": {
		"prov": "山东",
		"lnt": 116.601,
		"lat": 35.4021
	},
	"海东地区市": {
		"prov": "青海",
		"lnt": 102.085,
		"lat": 36.5176
	},
	"海北州市": {
		"prov": "青海",
		"lnt": 100.88,
		"lat": 36.9607
	},
	"海南州市": {
		"prov": "青海",
		"lnt": 100.624,
		"lat": 36.2844
	},
	"海口市": {
		"prov": "海南",
		"lnt": 110.331,
		"lat": 20.0221
	},
	"海西州市": {
		"prov": "青海",
		"lnt": 97.3426,
		"lat": 37.3738
	},
	"淄博市": {
		"prov": "山东",
		"lnt": 118.059,
		"lat": 36.8047
	},
	"淮北市": {
		"prov": "安徽",
		"lnt": 116.791,
		"lat": 33.96
	},
	"淮南市": {
		"prov": "安徽",
		"lnt": 117.019,
		"lat": 32.6428
	},
	"淮安市": {
		"prov": "江苏",
		"lnt": 119.03,
		"lat": 33.6065
	},
	"深圳市": {
		"prov": "广东",
		"lnt": 114.026,
		"lat": 22.5461
	},
	"清远市": {
		"prov": "广东",
		"lnt": 113.041,
		"lat": 23.6985
	},
	"温州市": {
		"prov": "浙江",
		"lnt": 120.691,
		"lat": 28.0028
	},
	"渭南市": {
		"prov": "陕西",
		"lnt": 109.484,
		"lat": 34.5024
	},
	"湖州市": {
		"prov": "浙江",
		"lnt": 120.137,
		"lat": 30.8779
	},
	"湘潭市": {
		"prov": "湖南",
		"lnt": 112.936,
		"lat": 27.8351
	},
	"湘西州市": {
		"prov": "湖南",
		"lnt": 109.746,
		"lat": 28.318
	},
	"湛江市": {
		"prov": "广东",
		"lnt": 110.365,
		"lat": 21.2575
	},
	"滁州市": {
		"prov": "安徽",
		"lnt": 118.325,
		"lat": 32.3174
	},
	"滨州市": {
		"prov": "山东",
		"lnt": 117.968,
		"lat": 37.4053
	},
	"漯河市": {
		"prov": "河南",
		"lnt": 114.046,
		"lat": 33.5763
	},
	"漳州市": {
		"prov": "福建",
		"lnt": 117.676,
		"lat": 24.5171
	},
	"潍坊市": {
		"prov": "山东",
		"lnt": 119.143,
		"lat": 36.7161
	},
	"潜江市": {
		"prov": "湖北",
		"lnt": 112.769,
		"lat": 30.3431
	},
	"潮州市": {
		"prov": "广东",
		"lnt": 116.63,
		"lat": 23.6618
	},
	"澄迈市": {
		"prov": "海南",
		"lnt": 109.997,
		"lat": 19.6931
	},
	"澳门市": {
		"prov": "澳门",
		"lnt": 113.558,
		"lat": 22.2041
	},
	"濮阳市": {
		"prov": "河南",
		"lnt": 115.027,
		"lat": 35.7533
	},
	"烟台市": {
		"prov": "山东",
		"lnt": 121.31,
		"lat": 37.5366
	},
	"焦作市": {
		"prov": "河南",
		"lnt": 113.212,
		"lat": 35.2346
	},
	"牡丹江市": {
		"prov": "黑龙江",
		"lnt": 129.608,
		"lat": 44.5885
	},
	"玉林市": {
		"prov": "广西",
		"lnt": 110.152,
		"lat": 22.644
	},
	"玉树州市": {
		"prov": "青海",
		"lnt": 97.0133,
		"lat": 33.0062
	},
	"玉溪市": {
		"prov": "云南",
		"lnt": 102.545,
		"lat": 24.3704
	},
	"珠海市": {
		"prov": "广东",
		"lnt": 113.562,
		"lat": 22.2569
	},
	"琼中市": {
		"prov": "海南",
		"lnt": 109.862,
		"lat": 19.0398
	},
	"琼海市": {
		"prov": "海南",
		"lnt": 110.414,
		"lat": 19.2148
	},
	"甘南州市": {
		"prov": "甘肃",
		"lnt": 102.917,
		"lat": 34.9922
	},
	"甘孜州市": {
		"prov": "四川",
		"lnt": 101.969,
		"lat": 30.0551
	},
	"白城市": {
		"prov": "吉林",
		"lnt": 122.841,
		"lat": 45.6211
	},
	"白山市": {
		"prov": "吉林",
		"lnt": 126.436,
		"lat": 41.9459
	},
	"白沙市": {
		"prov": "海南",
		"lnt": 109.359,
		"lat": 19.2161
	},
	"白银市": {
		"prov": "甘肃",
		"lnt": 104.171,
		"lat": 36.5467
	},
	"百色市": {
		"prov": "广西",
		"lnt": 106.632,
		"lat": 23.9015
	},
	"益阳市": {
		"prov": "湖南",
		"lnt": 112.367,
		"lat": 28.5881
	},
	"盐城市": {
		"prov": "江苏",
		"lnt": 120.149,
		"lat": 33.3799
	},
	"盘锦市": {
		"prov": "辽宁",
		"lnt": 122.073,
		"lat": 41.1412
	},
	"眉山市": {
		"prov": "四川",
		"lnt": 103.841,
		"lat": 30.0611
	},
	"石嘴山市": {
		"prov": "宁夏",
		"lnt": 106.379,
		"lat": 39.0202
	},
	"石家庄市": {
		"prov": "河北",
		"lnt": 114.522,
		"lat": 38.049
	},
	"石河子市": {
		"prov": "新疆",
		"lnt": 86.0419,
		"lat": 44.3083
	},
	"神农架林区市": {
		"prov": "湖北",
		"lnt": 110.487,
		"lat": 31.5958
	},
	"福州市": {
		"prov": "福建",
		"lnt": 119.33,
		"lat": 26.0471
	},
	"秦皇岛市": {
		"prov": "河北",
		"lnt": 119.604,
		"lat": 39.9455
	},
	"红河州市": {
		"prov": "云南",
		"lnt": 103.384,
		"lat": 23.3677
	},
	"绍兴市": {
		"prov": "浙江",
		"lnt": 120.592,
		"lat": 30.0024
	},
	"绥化市": {
		"prov": "黑龙江",
		"lnt": 126.989,
		"lat": 46.6461
	},
	"绵阳市": {
		"prov": "四川",
		"lnt": 104.706,
		"lat": 31.5047
	},
	"聊城市": {
		"prov": "山东",
		"lnt": 115.987,
		"lat": 36.4558
	},
	"肇庆市": {
		"prov": "广东",
		"lnt": 112.48,
		"lat": 23.0787
	},
	"自贡市": {
		"prov": "四川",
		"lnt": 104.776,
		"lat": 29.3592
	},
	"舟山市": {
		"prov": "浙江",
		"lnt": 122.17,
		"lat": 30.036
	},
	"芜湖市": {
		"prov": "安徽",
		"lnt": 118.384,
		"lat": 31.366
	},
	"苏州市": {
		"prov": "江苏",
		"lnt": 120.62,
		"lat": 31.318
	},
	"茂名市": {
		"prov": "广东",
		"lnt": 110.931,
		"lat": 21.6682
	},
	"荆州市": {
		"prov": "湖北",
		"lnt": 112.242,
		"lat": 30.3326
	},
	"荆门市": {
		"prov": "湖北",
		"lnt": 112.217,
		"lat": 31.0426
	},
	"莆田市": {
		"prov": "福建",
		"lnt": 119.078,
		"lat": 25.4485
	},
	"莱芜市": {
		"prov": "山东",
		"lnt": 117.685,
		"lat": 36.2337
	},
	"菏泽市": {
		"prov": "山东",
		"lnt": 115.463,
		"lat": 35.2624
	},
	"萍乡市": {
		"prov": "江西",
		"lnt": 113.86,
		"lat": 27.6395
	},
	"营口市": {
		"prov": "辽宁",
		"lnt": 122.233,
		"lat": 40.6687
	},
	"葫芦岛市": {
		"prov": "辽宁",
		"lnt": 120.861,
		"lat": 40.743
	},
	"蚌埠市": {
		"prov": "安徽",
		"lnt": 117.357,
		"lat": 32.9295
	},
	"衡水市": {
		"prov": "河北",
		"lnt": 115.686,
		"lat": 37.7469
	},
	"衡阳市": {
		"prov": "湖南",
		"lnt": 112.584,
		"lat": 26.8982
	},
	"衢州市": {
		"prov": "浙江",
		"lnt": 118.876,
		"lat": 28.9569
	},
	"襄樊市": {
		"prov": "湖北",
		"lnt": 112.176,
		"lat": 32.0949
	},
	"西双版纳市": {
		"prov": "云南",
		"lnt": 100.803,
		"lat": 22.0094
	},
	"西宁市": {
		"prov": "青海",
		"lnt": 101.768,
		"lat": 36.6407
	},
	"西安市": {
		"prov": "陕西",
		"lnt": 108.953,
		"lat": 34.2778
	},
	"许昌市": {
		"prov": "河南",
		"lnt": 113.835,
		"lat": 34.0267
	},
	"贵港市": {
		"prov": "广西",
		"lnt": 109.614,
		"lat": 23.1034
	},
	"贵阳市": {
		"prov": "贵州",
		"lnt": 106.709,
		"lat": 26.6299
	},
	"贺州市": {
		"prov": "广西",
		"lnt": 111.553,
		"lat": 24.4111
	},
	"资阳市": {
		"prov": "四川",
		"lnt": 104.636,
		"lat": 30.1322
	},
	"赣州市": {
		"prov": "江西",
		"lnt": 114.936,
		"lat": 25.8453
	},
	"赤峰市": {
		"prov": "内蒙古",
		"lnt": 118.931,
		"lat": 42.2971
	},
	"辽源市": {
		"prov": "吉林",
		"lnt": 125.134,
		"lat": 42.9233
	},
	"辽阳市": {
		"prov": "辽宁",
		"lnt": 123.172,
		"lat": 41.2733
	},
	"达州市": {
		"prov": "四川",
		"lnt": 107.495,
		"lat": 31.2142
	},
	"运城市": {
		"prov": "山西",
		"lnt": 111.007,
		"lat": 35.0389
	},
	"连云港市": {
		"prov": "江苏",
		"lnt": 119.174,
		"lat": 34.6015
	},
	"迪庆州市": {
		"prov": "云南",
		"lnt": 99.7137,
		"lat": 27.831
	},
	"通化市": {
		"prov": "吉林",
		"lnt": 125.943,
		"lat": 41.7364
	},
	"通辽市": {
		"prov": "内蒙古",
		"lnt": 122.26,
		"lat": 43.6338
	},
	"遂宁市": {
		"prov": "四川",
		"lnt": 105.565,
		"lat": 30.5575
	},
	"遵义市": {
		"prov": "贵州",
		"lnt": 106.931,
		"lat": 27.7
	},
	"邢台市": {
		"prov": "河北",
		"lnt": 114.52,
		"lat": 37.0695
	},
	"那曲地区市": {
		"prov": "西藏",
		"lnt": 92.067,
		"lat": 31.4807
	},
	"邯郸市": {
		"prov": "河北",
		"lnt": 114.483,
		"lat": 36.6093
	},
	"邵阳市": {
		"prov": "湖南",
		"lnt": 111.462,
		"lat": 27.2368
	},
	"郑州市": {
		"prov": "河南",
		"lnt": 113.65,
		"lat": 34.7566
	},
	"郴州市": {
		"prov": "湖南",
		"lnt": 113.038,
		"lat": 25.7823
	},
	"鄂尔多斯市": {
		"prov": "内蒙古",
		"lnt": 109.994,
		"lat": 39.8165
	},
	"鄂州市": {
		"prov": "湖北",
		"lnt": 114.896,
		"lat": 30.3844
	},
	"酒泉市": {
		"prov": "甘肃",
		"lnt": 98.5084,
		"lat": 39.7415
	},
	"重庆市": {
		"prov": "重庆",
		"lnt": 106.531,
		"lat": 29.5446
	},
	"金华市": {
		"prov": "浙江",
		"lnt": 119.653,
		"lat": 29.1029
	},
	"金昌市": {
		"prov": "甘肃",
		"lnt": 102.208,
		"lat": 38.5161
	},
	"钦州市": {
		"prov": "广西",
		"lnt": 108.639,
		"lat": 21.9734
	},
	"铁岭市": {
		"prov": "辽宁",
		"lnt": 123.855,
		"lat": 42.2998
	},
	"铜仁地区市": {
		"prov": "贵州",
		"lnt": 109.196,
		"lat": 27.7263
	},
	"铜川市": {
		"prov": "陕西",
		"lnt": 108.968,
		"lat": 34.9084
	},
	"铜陵市": {
		"prov": "安徽",
		"lnt": 117.819,
		"lat": 30.9409
	},
	"银川市": {
		"prov": "宁夏",
		"lnt": 106.206,
		"lat": 38.5026
	},
	"锡林郭勒盟市": {
		"prov": "内蒙古",
		"lnt": 116.027,
		"lat": 43.9397
	},
	"锦州市": {
		"prov": "辽宁",
		"lnt": 121.148,
		"lat": 41.1309
	},
	"镇江市": {
		"prov": "江苏",
		"lnt": 119.456,
		"lat": 32.2044
	},
	"长春市": {
		"prov": "吉林",
		"lnt": 125.314,
		"lat": 43.8983
	},
	"长沙市": {
		"prov": "湖南",
		"lnt": 112.979,
		"lat": 28.2135
	},
	"长治市": {
		"prov": "山西",
		"lnt": 113.12,
		"lat": 36.2017
	},
	"阜新市": {
		"prov": "辽宁",
		"lnt": 121.661,
		"lat": 42.0192
	},
	"阜阳市": {
		"prov": "安徽",
		"lnt": 115.821,
		"lat": 32.9012
	},
	"防城港市": {
		"prov": "广西",
		"lnt": 108.352,
		"lat": 21.6174
	},
	"阳江市": {
		"prov": "广东",
		"lnt": 111.977,
		"lat": 21.8715
	},
	"阳泉市": {
		"prov": "山西",
		"lnt": 113.569,
		"lat": 37.8695
	},
	"阿克苏地区市": {
		"prov": "新疆",
		"lnt": 80.2698,
		"lat": 41.1717
	},
	"阿勒泰地区市": {
		"prov": "新疆",
		"lnt": 88.1379,
		"lat": 47.8397
	},
	"阿坝州市": {
		"prov": "四川",
		"lnt": 102.229,
		"lat": 31.9058
	},
	"阿拉善盟市": {
		"prov": "内蒙古",
		"lnt": 105.696,
		"lat": 38.8431
	},
	"阿拉尔市": {
		"prov": "新疆",
		"lnt": 81.2917,
		"lat": 40.6157
	},
	"阿里地区市": {
		"prov": "西藏",
		"lnt": 81.1077,
		"lat": 30.4046
	},
	"陇南市": {
		"prov": "甘肃",
		"lnt": 104.935,
		"lat": 33.3945
	},
	"陵水市": {
		"prov": "海南",
		"lnt": 109.949,
		"lat": 18.576
	},
	"随州市": {
		"prov": "湖北",
		"lnt": 113.379,
		"lat": 31.7179
	},
	"雅安市": {
		"prov": "四川",
		"lnt": 103.009,
		"lat": 29.9997
	},
	"青岛市": {
		"prov": "山东",
		"lnt": 120.384,
		"lat": 36.1052
	},
	"鞍山市": {
		"prov": "辽宁",
		"lnt": 123.008,
		"lat": 41.1187
	},
	"韶关市": {
		"prov": "广东",
		"lnt": 113.594,
		"lat": 24.803
	},
	"香港市": {
		"prov": "香港",
		"lnt": 114.186,
		"lat": 22.2936
	},
	"马鞍山市": {
		"prov": "安徽",
		"lnt": 118.516,
		"lat": 31.6885
	},
	"驻马店市": {
		"prov": "河南",
		"lnt": 114.049,
		"lat": 32.9832
	},
	"鸡西市": {
		"prov": "黑龙江",
		"lnt": 130.942,
		"lat": 45.3215
	},
	"鹤壁市": {
		"prov": "河南",
		"lnt": 114.298,
		"lat": 35.7554
	},
	"鹤岗市": {
		"prov": "黑龙江",
		"lnt": 130.292,
		"lat": 47.3387
	},
	"鹰潭市": {
		"prov": "江西",
		"lnt": 117.035,
		"lat": 28.2413
	},
	"黄冈市": {
		"prov": "湖北",
		"lnt": 114.907,
		"lat": 30.4461
	},
	"黄南州市": {
		"prov": "青海",
		"lnt": 102.008,
		"lat": 35.5229
	},
	"黄山市": {
		"prov": "安徽",
		"lnt": 118.294,
		"lat": 29.7344
	},
	"黄石市": {
		"prov": "湖北",
		"lnt": 115.051,
		"lat": 30.2161
	},
	"黑河市": {
		"prov": "黑龙江",
		"lnt": 127.501,
		"lat": 50.2507
	},
	"黔东南州市": {
		"prov": "贵州",
		"lnt": 107.985,
		"lat": 26.584
	},
	"黔南州市": {
		"prov": "贵州",
		"lnt": 107.523,
		"lat": 26.2645
	},
	"黔西南州市": {
		"prov": "贵州",
		"lnt": 104.901,
		"lat": 25.0951
	},
	"齐齐哈尔市": {
		"prov": "黑龙江",
		"lnt": 123.987,
		"lat": 47.3477
	},
	"龙岩市": {
		"prov": "福建",
		"lnt": 117.018,
		"lat": 25.0787
	}
}

module.exports = locations;
